# Pandas #02

In [5]:
import pandas as pd

# Creating a dataframe

In [17]:
# First Last Email
# row1
# row2

# Using columns
df = pd.DataFrame(
    {"First": ["Burouj", "Anshika", "Virat"],
     "Last": ["Armgaan", None, "Kohli"],
     "Email": ["armgaan009@gmail.com", "anshika@gmail.com", "vk@gmail.com"]}
)

# Using rows
df2 = pd.DataFrame([
    ["Burouj", "Armgaan", "armgaan009@gmail.com"],
    ["Anshika", None, "anshika@gmail.com"],
    ["Virat", "Kohli", "vk@gmail.com"]],
    columns = ["First", "Last", "Email"]
)

In [19]:
df

     First     Last                 Email
0   Burouj  Armgaan  armgaan009@gmail.com
1  Anshika     None     anshika@gmail.com
2    Virat    Kohli          vk@gmail.com

In [18]:
df2

     First     Last                 Email
0   Burouj  Armgaan  armgaan009@gmail.com
1  Anshika     None     anshika@gmail.com
2    Virat    Kohli          vk@gmail.com

In [20]:
df

     First     Last                 Email
0   Burouj  Armgaan  armgaan009@gmail.com
1  Anshika     None     anshika@gmail.com
2    Virat    Kohli          vk@gmail.com

In [22]:
# One should remember the order of the columns
df.loc[3] = ["Ishan", None, "ish@gmail.com"]
df

     First     Last                 Email
0   Burouj  Armgaan  armgaan009@gmail.com
1  Anshika     None     anshika@gmail.com
2    Virat    Kohli          vk@gmail.com
3    Ishan     None         ish@gmail.com

In [23]:
# Pass a dictionary
df.loc[4] = {"First": "Ishan", "Email": "ish@gmail.com"}
df

     First     Last                 Email
0   Burouj  Armgaan  armgaan009@gmail.com
1  Anshika     None     anshika@gmail.com
2    Virat    Kohli          vk@gmail.com
3    Ishan     None         ish@gmail.com
4    Ishan      NaN         ish@gmail.com

# Saving and Loading dataframes

In [24]:
# csv: comman separated values
df.to_csv("my_df.csv")

In [25]:
df_temp = pd.read_csv("my_df.csv")
df_temp

   Unnamed: 0    First     Last                 Email
0           0   Burouj  Armgaan  armgaan009@gmail.com
1           1  Anshika      NaN     anshika@gmail.com
2           2    Virat    Kohli          vk@gmail.com
3           3    Ishan      NaN         ish@gmail.com
4           4    Ishan      NaN         ish@gmail.com

In [29]:
df.to_csv("my_df.csv", index=False)

In [30]:
df_temp = pd.read_csv("my_df.csv")
df_temp

     First     Last                 Email
0   Burouj  Armgaan  armgaan009@gmail.com
1  Anshika      NaN     anshika@gmail.com
2    Virat    Kohli          vk@gmail.com
3    Ishan      NaN         ish@gmail.com
4    Ishan      NaN         ish@gmail.com

# Updating a dataframe

In [50]:
df = pd.DataFrame([
    ["Burouj", "Armgaan", "armgaan009@gmail.com"],
    ["Anshika", "Rai", "anshika@gmail.com"],
    ["Virat", "Kohli", "vk@gmail.com"]],
    columns = ["First", "Last", "Email"]
)
df

     First     Last                 Email
0   Burouj  Armgaan  armgaan009@gmail.com
1  Anshika      Rai     anshika@gmail.com
2    Virat    Kohli          vk@gmail.com

## Views vs Copies

In [51]:
# Entries whose email id starts with "a" should be replaced with "temp"
filter = df.Email.str.startswith("a")
df[filter]["Email"] = "temp" # This line returns a copy of the dataframe

/var/folders/g8/nb5r8lhs1vx9ncfrknzljjv00000gn/T/ipykernel_69652/1713132517.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[filter]["Email"] = "temp" # This line returns a copy of the dataframe

In [52]:
df

     First     Last                 Email
0   Burouj  Armgaan  armgaan009@gmail.com
1  Anshika      Rai     anshika@gmail.com
2    Virat    Kohli          vk@gmail.com

In [53]:
# loc returns the origianl dataframe
df.loc[filter, "Email"] = "temp"
df

     First     Last         Email
0   Burouj  Armgaan          temp
1  Anshika      Rai          temp
2    Virat    Kohli  vk@gmail.com

## Apply
Applies a function to a Seires or a DataFrame

In [54]:
# len
# len()
df.Email.apply(len)

0     4
1     4
2    12
Name: Email, dtype: int64

In [55]:
# One can pass any function
df.Email.apply(lambda x: x[0])

0    t
1    t
2    v
Name: Email, dtype: object

In [56]:
# When applied on a dataframe, it acts on entire rows or columns instead of individual entries.
df.apply(min) # default behaviour is to work along rows

First    Anshika
Last     Armgaan
Email       temp
dtype: object

In [60]:
# When applied on a dataframe, it acts on entire rows or columns instead of individual entries.
df.apply(min, axis=1) # default behaviour is to work on columns

0    Armgaan
1    Anshika
2      Kohli
dtype: object

In [61]:
df.apply(min, axis="columns") # default behaviour is to work on columns

0    Armgaan
1    Anshika
2      Kohli
dtype: object

## Applymap
- Use: Apply a function to all entries of a dataframe.
- Deprecated. Use "Map" instead

In [57]:
df.applymap(len)

/var/folders/g8/nb5r8lhs1vx9ncfrknzljjv00000gn/T/ipykernel_69652/1485728669.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(len)

   First  Last  Email
0      6     7      4
1      7     3      4
2      5     5     12

## Map

In [73]:
# When used like this, it expects a mapping for every entry
df.Last.map({"Armgaan": "ABC", "Kohli": "XYZ"})

0    ABC
1    NaN
2    XYZ
Name: Last, dtype: object

In [65]:
df.map(len)

   First  Last  Email
0      6     7      4
1      7     3      4
2      5     5     12

## Replace

In [74]:
df.Last.replace({"Armgaan": "ABC", "Kohli": "XYZ"})

0    ABC
1    Rai
2    XYZ
Name: Last, dtype: object

# Concatenation
Merge tables vertically

In [76]:
# Using columns
df = pd.DataFrame(
    {"First": ["Burouj", "Anshika", "Virat"],
     "Last": ["Armgaan", "Rai", "Kohli"],
     "Email": ["armgaan009@gmail.com", "anshika@gmail.com", "vk@gmail.com"]}
)

# Using rows
df2 = pd.DataFrame([
    ["Sayan", "Ranu", "sr@gmail.com"],
    ["Ishan", "K", "ish@gmail.com"]],
    columns = ["First", "Last", "Email"]
)

In [77]:
df

     First     Last                 Email
0   Burouj  Armgaan  armgaan009@gmail.com
1  Anshika      Rai     anshika@gmail.com
2    Virat    Kohli          vk@gmail.com

In [78]:
df2

   First  Last          Email
0  Sayan  Ranu   sr@gmail.com
1  Ishan     K  ish@gmail.com

In [80]:
pd.concat([df, df2], ignore_index=True)

     First     Last                 Email
0   Burouj  Armgaan  armgaan009@gmail.com
1  Anshika      Rai     anshika@gmail.com
2    Virat    Kohli          vk@gmail.com
3    Sayan     Ranu          sr@gmail.com
4    Ishan        K         ish@gmail.com

# Joining tables

In [83]:
# Merge: left, right, inner, outer

adf = pd.DataFrame([
    ["A", 1],
    ["B", 2],
    ["C", 3]],
    columns=["x1", "x2"]
)
adf

  x1  x2
0  A   1
1  B   2
2  C   3

In [92]:
bdf = pd.DataFrame([
    ["A", "T"],
    ["B", "F"],
    ["D", "T"]],
    columns=["x1", "x3"]
)
bdf

  x1 x3
0  A  T
1  B  F
2  D  T

## Left merge
- Keep all entries from "left" df.
- Exclude entreis from "right" df that are not in "left" df.

In [91]:
# Key should be unique
# Key should be in both tables
pd.merge(adf, bdf, on="x1", how="left")

  x1  x2_x x2_y
0  A     1    T
1  B     2    F
2  C     3  NaN

## Right merge

In [87]:
# Key should be unique
# Key should be in both tables
pd.merge(adf, bdf, on="x1", how="right")

  x1   x2 x3
0  A  1.0  T
1  B  2.0  F
2  D  NaN  T

## Inner merge

In [88]:
pd.merge(adf, bdf, on="x1", how="inner")

  x1  x2 x3
0  A   1  T
1  B   2  F

## Outer merge

In [89]:
pd.merge(adf, bdf, on="x1", how="outer")

  x1   x2   x3
0  A  1.0    T
1  B  2.0    F
2  C  3.0  NaN
3  D  NaN    T

## Same column names when merging
Pandas renames the columns

In [93]:
adf

  x1  x2
0  A   1
1  B   2
2  C   3

In [94]:
bdf

  x1 x3
0  A  T
1  B  F
2  D  T

In [99]:
bdf_new = bdf.rename({"x3": "x2"}, axis=1)
bdf

  x1 x3
0  A  T
1  B  F
2  D  T

In [101]:
# Key should be unique
# Key should be in both tables
pd.merge(adf, bdf_new, on="x1", how="left")

  x1  x2_x x2_y
0  A     1    T
1  B     2    F
2  C     3  NaN

# Next class
- Grouping, Visualization, Cleaning